/*
[3, 1, 5, 0, 7, 9, 8]
сравниваем пары элементов, начиная с [3, 1],
[3, 1]
 3 > 1, поэтому нужно поменять элементы местами
1. [1, 3, 5, 0, 7, 9, 8],
 [3,5]
3 < 5,  элементы остаются на месте
2. [1, 3, 5, 0, 7, 9, 8],
[5, 0]
5 > 0, поэтому нужно поменять элементы местами
3. [1, 3, 0, 5, 7, 9, 8],
[ 3, 0]
0 < 3,  поменяем элементы местами
4. [1, 0, 3, 5, 7, 9, 8]
[1, 0]
 0 < 1,  поменяем элементы местами
5. [0, 1, 3, 5, 7, 9, 8]

6. [0, 1, 3, 5, 7, 9, 8]
снова проверяем пары элементов начиная с начала массива
9 > 8, поэтому нужно поменять элементы местам
6. [0, 1, 3, 5, 7, 8, 9]
*/
Console.WriteLine("Ввведите количество элементов массива:");
int n = Convert.ToInt32(Console.ReadLine());
int[] array = new int[n];
for (int i = 0; i < n; i++)
{
    Console.Write("Введите значения элементов массива:");
    array[i] = Convert.ToInt32(Console.ReadLine());
}
Console.WriteLine("Начальный массив: [" + string.Join(", ", array) + "]");
int temp;
for (int i = 0; i < n; i++)
{
    for (int j = 1; j < n; j++)
    {
        if (array[j - 1] > array[j])
        {
            temp = array[j-1];
            array[j -1] = array[j];
            array[j] = temp;
        }
        
    }
    Console.WriteLine($"Step {i} : [" + string.Join(", ", array) + "]");
}